app/controllers/tvshows_controller.rb

  def index
    @tvshows = Tvshow.all
---
SELECT "tvshows".* FROM "tvshows"

  def show
    @user = User.find(session[:user_id])
    @tvshow = Tvshow.find(params[:id])
---
SELECT  "tvshows".* FROM "tvshows" WHERE "tvshows"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @tvshow = Tvshow.find_or_create_by(tvshow_params)
---
INSERT INTO "tvshows" ("name", "tvmaze_id", "likes", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Rachael Ray"], ["tvmaze_id", 9077], ["likes", 12], ["created_at", "2019-03-07 06:23:31.822877"], ["updated_at", "2019-03-07 06:23:31.822877"]]