app/controllers/user_shows_controller.rb

SELECT "user_shows".* FROM "user_shows"
---
	def index
		@user_shows = UserShow.all

INSERT INTO "user_shows" ("tvshow_id", "user_id", "ext_tvmaze_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tvshow_id", 1], ["user_id", 1], ["ext_tvmaze_id", 4344], ["created_at", "2019-03-07 16:53:07.851732"], ["updated_at", "2019-03-07 16:53:07.851732"]]
---
	def create
	    @user_show = UserShow.find_or_create_by(user_show_params)

SELECT  "user_shows".* FROM "user_shows" WHERE "user_shows"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
DELETE FROM "user_shows" WHERE "user_shows"."id" = $1  [["id", 34]]
---
	def destroy
	    @user_show = UserShow.find(params[:id])
	    @user_show.destroy