app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ed4"], ["created_at", "2019-03-07 05:34:18.177115"], ["updated_at", "2019-03-07 05:34:18.177115"]]